site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Course Introduction
:PROPERTIES:
:ID:       d6691455-f4dc-44ec-b6ae-2b169766e1af
:EXPORT_FILE_NAME: course-introduction
:EXPORT_DATE: 2023-01-18
:END:

Welcome to Competitive Programming!  Today we will talk about the benefits of competitive programming, the course structure, and the tools we will
use in the course.

*** Slides
- [[/slides/course-introduction.pdf][Course Introduction Slides]]

*** Judge Links
  - Register on [[https://codeforces.com][Code Forces]].  Your username *will be visible* to other students; you can create a "throwaway"
    account if you want just for this course.
    - Once you are registered, join [[https://codeforces.com/group/C1FCILxvRp/contests][the Class Group]].  This is where your problems
      will be hosted.
  - Similarly, register on [[https://vjudge.net][VJudge.net]] and for the [[https://vjudge.net/group/uiuc-cs491-sp23][Class Group]].

