content/lectures/course-introduction.md
+++
title = "Course Introduction"
author = ["Mattox Beckman"]
draft = false
+++

Welcome to Competitive Programming!  Today we will talk about the benefits of competitive programming, the course structure, and the tools we will
use in the course.


## Slides {#slides}

-   [Course Introduction Slides](/slides/course-introduction.pdf)


## Judge Links {#judge-links}

-   Register on [Code Forces](https://codeforces.com).  Your username **will be visible** to other students; you can create a "throwaway"
    account if you want just for this course.
    -   Once you are registered, join [the Class Group](https://codeforces.com/group/C1FCILxvRp/contests).  This is where your problems
        will be hosted.
-   Similarly, register on [VJudge.net](https://vjudge.net) and for the [Class Group](https://vjudge.net/group/uiuc-cs491-sp23).
